#Author : taosenlin
#Time : 2020/2/27 16:22

# 一、列表（序列类型：1、下标   2、切片）
# （1）可以存储任何类型的数据，每个元素是任意类型（列表可以通过下标或者切片获取）
# （2）列表的元素可以改变，而字符串则不行



# （3）列表常用操作

# alist = [10,3.14,'hello',[100,200]]
# a、增加元素
# alist.append(55)
# print(alist)        #[10, 3.14, 'hello', [100, 200], 55]

# alist.insert(1,55)    #列表名.insert(下标，值)
# print(alist)          #[10, 55, 3.14, 'hello', [100, 200]]
#当下标位置大于整体元素下标，则相当于从尾部增加



# alist = [10,3.14,'hello',[100,200]]
# b、删除元素
# del alist[1]            #通过下标删除
# print(alist)            #[10, 'hello', [100, 200]]

# del alist[1],alist[2]
# print(alist)              #[10, 'hello']

# del alist[1:1+2]            #一起删除
# print(alist)                #[10, [100, 200]]


# alist.pop(1)                  #列表名.pop(下标)
# print(alist.pop(1))           #3.14    #通过下标删除---有返回值
# print(alist)                  #[10, 'hello', [100, 200]]


# alist.remove(3.14)              #列表名.remove(值)
# print(alist)                    #[10, 'hello', [100, 200]]
#删除值---只能遍历去找，只能删除一个（找到就删除然后停止）


# alist.clear()        #清空
# print(alist)
# []


# alist = [10,3.14,'hello',[100,200]]
# c、修改元素---赋值
# alist[0] = 20              #修改元素---赋值
# print(alist)               #[20, 3.14, 'hello', [100, 200]]



# alist = [10,3.14,'hello',[100,200]]
# d、查找元素---下标、切片
# print(alist[0])        #10   #下标取出来的为int
# print(alist[1:4])      #[3.14, 'hello', [100, 200]]  #切片取出来的为原类型（列表）list

"""
alist = [6,2,5,8]
alist.sort()           #对列表进行排序（默认从小到大）
print(alist)
# [2, 5, 6, 8]
"""

# alist = [10,3.14,'hello',[100,200]]
# e、合并列表
# alist.extend([50,60])        #扩展---在已有地址里面对数据扩展
# print(alist)                 #[10, 3.14, 'hello', [100, 200], 50, 60]

# print(alist+[50,60])           #[10, 3.14, 'hello', [100, 200], 50, 60]
#临时---另存地址






# 二、元组
# 可以存储任何类型的数据，每个元素是任意类型
# 元组和list非常相似，但是有一个最大的不同---元组不能改变其组成元素

# （1）单个元组
# a = (1,)       #单个元组
# print(a)       #(1,)

# （2）空元组
# a = ()           #空元组
# print(a)         #()

# （3）元组常用操作
#元组不能改变元素值、元素的个数
#增、删、改不可用（类似只读文件）
#只可以查---下标、切片


# tu1 = (10,3.14,'hello',[100,200],(22,33))

# a、下标
# print(tu1)               #(10, 3.14, 'hello', [100, 200], (22, 33))
# print(tu1[0])              #10
# print(tu1.index(3.14))     #1   index---获取下标

# tu1[3][0] = 300            #对元组中的列表内的元素可以改动
# print(tu1)                 #(10, 3.14, 'hello', [300, 200], (22, 33))


# tu1 = (10,3.14,'hello',[100,200],(22,33))

# b、切片（元组切片与列表类似，切完还是元组）
# print(tu1[1:4])              #(3.14, 'hello', [100, 200])
# print(tu1[:3])               #(10, 3.14, 'hello')
# print(tu1[3][1])             #200


# alist = [10,20,30]

# c、列表转元组
# print(tuple(alist))         #(10, 20, 30)
# print(alist)                #[10, 20, 30]
# 转换出来是另存的一个新对象；对转换前的对象不会产生影响
























































