#Author : taosenlin
#Time : 2020/2/27 11:13
# 一、对象
# python3 : 只有int 没有long

# （1）除法，取商

# python2 :  9/4   2
# python3 :  9/4   2.25  /运算符 总是得到小数
# python3 ： 9//4  2     取整


# (2)除法，取余数 : python2和python3都一样

# 9%4  1


# (3)除法，小数结果（python2得到小数的方法）

# 9.0/2   4.5


# 二、变量（给对象起个名字，通过名字访问到对象）
# 人类语言： 人、物体----名字
# 编程语言： 对象----变量

# （1）变量命名
# 变量由字母、数字、下划线组成
#一般以字母（大小写均可）开头

# （2）变量的定义过程，就是赋值的过程
# 注意：在python里面定义变量要给初始值

# a = 100
# print(id(a))  #对象内存地址


# （3）变量操作
#a += 1  #等于a = a + 1
#a -= 2  #等于a = a - 2
#a *= 3  #等于a = a * 3
#a /= 4  #等于a = a / 4













































